<a href="https://colab.research.google.com/github/varshasathish/intern-assignments/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [17]:
import numpy as np
import pandas as pd
from sklearn import cluster, preprocessing

In [26]:
df = pd.read_excel("js.xls")
df.head()

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [27]:
df.drop(['name','body'], 1, inplace=True)
df.head()

   pclass  survived     sex  ...  embarked  boat                        home.dest
0       1         1  female  ...         S     2                     St Louis, MO
1       1         1    male  ...         S    11  Montreal, PQ / Chesterville, ON
2       1         0  female  ...         S   NaN  Montreal, PQ / Chesterville, ON
3       1         0    male  ...         S   NaN  Montreal, PQ / Chesterville, ON
4       1         0  female  ...         S   NaN  Montreal, PQ / Chesterville, ON

[5 rows x 12 columns]

In [28]:
df.fillna(0, inplace=True)
df.head()

   pclass  survived     sex  ...  embarked  boat                        home.dest
0       1         1  female  ...         S     2                     St Louis, MO
1       1         1    male  ...         S    11  Montreal, PQ / Chesterville, ON
2       1         0  female  ...         S     0  Montreal, PQ / Chesterville, ON
3       1         0    male  ...         S     0  Montreal, PQ / Chesterville, ON
4       1         0  female  ...         S     0  Montreal, PQ / Chesterville, ON

[5 rows x 12 columns]

In [29]:
columns = df.columns.values
for i in columns:
    text_value_int = {}
    def text_to_val(val):
        return text_value_int[val]
    if df[i].dtype != np.int64 and df[i].dtype != np.float64:
        all_text = df[i].values.tolist()
        unique_elements = set(all_text)
        
        x = 0
        for unique in unique_elements:
            if unique not in text_value_int:
                text_value_int[unique] = x
                x+=1
        
        df[i] = list(map(text_to_val, df[i]))

In [32]:
df.head()

   pclass  survived  sex      age  ...  cabin  embarked  boat  home.dest
0       1         1    0  29.0000  ...    156         1     1        179
1       1         1    1   0.9167  ...    147         1     2        332
2       1         0    0   2.0000  ...    147         1     0        332
3       1         0    1  30.0000  ...    147         1     0        332
4       1         0    0  25.0000  ...    147         1     0        332

[5 rows x 12 columns]

In [33]:
X = np.array(df.drop('survived', 1))
y = np.array(df['survived'])

In [34]:
clf = cluster.KMeans(n_clusters=2)
clf.fit(X)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=2, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=0)

In [35]:
clf = cluster.KMeans(n_clusters=2)
clf.fit(X)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=2, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=0)

In [39]:
found = 0
for i in range(len(X)):
    new_prediction = np.array(X[i].astype(float))
    new_prediction = new_prediction.reshape(-1, len(new_prediction))
    prediction = clf.predict(new_prediction)
    if prediction[0] == y[i]:
        found += 1

accuracy = (found/len(X))*100
accuracy

72.80366692131398

In [38]:
X = preprocessing.scale(X)
clf.fit(X)
found = 0
for i in range(len(X)):
    new_prediction = np.array(X[i].astype(float))
    new_prediction = new_prediction.reshape(-1, len(new_prediction))
    prediction = clf.predict(new_prediction)
    if prediction[0] == y[i]:
        found += 1

accuracy = (found/len(X))*100
accuracy

72.80366692131398